app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
def index
  @article = Article.paginate(:page => params[:page], :per_page => 3)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "That is my first articles"], ["description", "lorem ipsom dolor marvio rocha"], ["created_at", "2017-10-12 20:19:46.374686"], ["updated_at", "2017-10-12 20:19:46.374686"]]
---
def create

@article = Article.new(article_params)
@article.user = User.first
if @article.save