app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"
---
def index
  #index page for categories
  @category = Category.paginate(:page => params[:page], :per_page => 5)

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]
---
def destroy
  if @category.destroy

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ASDSd"], ["created_at", "2017-11-05 23:04:07.316437"], ["updated_at", "2017-11-05 23:04:07.316437"]]
---
def create

  @category = Category.new(categories_params)

  if @category.save

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Macaé"], ["updated_at", "2017-11-05 23:39:12.441121"], ["id", 1]]
---
def update
 if @category.update(categories_params)