app/controllers/pages_controller.rb

SELECT  "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
---
  def blog
    @article = Article.paginate(:page => params[:page], :per_page => 3)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def view
    @article = Article.find(params[:id])